TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_unicommi2cc.h
/*
 * Copyright (c) 2024, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_unicommi2cc.h
 *  @brief      Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Controller (I2CC) Driver Library
 *  @defgroup   UNICOMMI2CC Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Controller (I2CC)
 *
 *  @anchor ti_dl_dl_m0p_unicommi2cc_Overview
 *  # Overview
 *
 *  Unified Communication Module Inter-Integrated Circuit Controller Driver Library allows
 *  full configuration of the UNICOMM I2CC module.
 *
 *  This Inter-Integrated Circuit Controller (I2CC) module provides a standardized
 *  interface to transfer data, as a controller, between devices and other external
 *  devices with the I2C interface.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup UNICOMMI2CC
 * @{
 */
#ifndef ti_dl_dl_unicommi2cc__include
#define ti_dl_dl_unicommi2cc__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/dl_unicomm.h>

#ifdef __MCU_HAS_UNICOMMI2CC__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_I2CC_STATUS
 *  @{
 */
/*!
 * @brief I2CC is busy
 *
 * The BUSY bit is set during an ongoing transaction, so is set during the
 * transmit/receive of the amount of data set in WBLEN including START, RESTART,
 * Address and STOP signal generation when required for the current transaction
 */
#define DL_I2CC_STATUS_BUSY                       (UNICOMMI2CC_SR_BUSY_MASK)

/*!
 * @brief I2CC error detected
 *
 * The error can be from the target address not being acknowledged or the
 * transmit data not being acknowledged
 */
#define DL_I2CC_STATUS_ERROR                       (UNICOMMI2CC_SR_ERR_MASK)

/*!
 * @brief I2CC address acknowledged
 */
#define DL_I2CC_STATUS_ADDR_ACK                 (UNICOMMI2CC_SR_ADRACK_MASK)

/*!
 * @brief I2CC data acknowledged
 */
#define DL_I2CC_STATUS_DATA_ACK                 (UNICOMMI2CC_SR_DATACK_MASK)

/*!
 * @brief I2CC arbitration lost
 */
#define DL_I2CC_STATUS_ARBITRATION_LOST         (UNICOMMI2CC_SR_ARBLST_MASK)

/*!
 * @brief I2CC idle
 */
#define DL_I2CC_STATUS_IDLE                       (UNICOMMI2CC_SR_IDLE_MASK)

/*!
 * @brief I2CC bus busy
 *
 * The bit changes based on the START and STOP conditions
 */
#define DL_I2CC_STATUS_BUSY_BUS                 (UNICOMMI2CC_SR_BUSBSY_MASK)

/** @}*/


/** @addtogroup DL_I2CC_INTERRUPT
 *  @{
 */
/*!
 * @brief Receive Transaction completed Interrupt
 */
#define DL_I2CC_INTERRUPT_RX_DONE  (UNICOMMI2CC_CPU_INT_IMASK_RXDONE_SET)

/*!
 * @brief Transmit Transaction completed Interrupt
 */
#define DL_I2CC_INTERRUPT_TX_DONE  (UNICOMMI2CC_CPU_INT_IMASK_TXDONE_SET)

/*!
 * @brief Receive FIFO Trigger when >= defined bytes
 */
#define DL_I2CC_INTERRUPT_RXFIFO_TRIGGER                            \
                                          (UNICOMMI2CC_CPU_INT_IMASK_RXTRG_SET)

/*!
 * @brief Transmit FIFO Trigger when <= defined bytes
 */
#define DL_I2CC_INTERRUPT_TXFIFO_TRIGGER                            \
                                          (UNICOMMI2CC_CPU_INT_IMASK_TXTRG_SET)

/*!
 * @brief Receive FIFO is full
 */
#define DL_I2CC_INTERRUPT_RXFIFO_FULL                               \
                                         (UNICOMMI2CC_CPU_INT_IMASK_RXFULL_SET)

/*!
 * @brief Transmit FIFO is empty
 */
#define DL_I2CC_INTERRUPT_TXFIFO_EMPTY                              \
                                            (UNICOMMI2CC_CPU_INT_IMASK_TXEMPTY_SET)

/*!
 * @brief Address/Data NACK Interrupt
 */
#define DL_I2CC_INTERRUPT_NACK       (UNICOMMI2CC_CPU_INT_IMASK_NACK_SET)

/*!
 * @brief START Detection Interrupt
 */
#define DL_I2CC_INTERRUPT_START     (UNICOMMI2CC_CPU_INT_IMASK_START_SET)

/*!
 * @brief STOP Detection Interrupt
 */
#define DL_I2CC_INTERRUPT_STOP       (UNICOMMI2CC_CPU_INT_IMASK_STOP_SET)

/*!
 * @brief Arbitration Lost Interrupt
 */
#define DL_I2CC_INTERRUPT_ARBITRATION_LOST                          \
                                            (UNICOMMI2CC_CPU_INT_IMASK_ARBLOST_SET)

/*!
 * @brief DMA Done on Event 1 publisher
 */
#define DL_I2CC_INTERRUPT_EVENT1_DMA_DONE                           \
                                       (UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA Done on Event 2 publisher
 */
#define DL_I2CC_INTERRUPT_EVENT2_DMA_DONE                           \
                                       (UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_RX_SET)


/*!
 * @brief SMBus/PMBus PEC Receive Error Interrupt
 */
#define DL_I2CC_INTERRUPT_PEC_RX_ERROR                              \
                                         (UNICOMMI2CC_CPU_INT_IMASK_PEC_RX_ERR_SET)

/*!
 * @brief Timeout A Interrupt
 */
#define DL_I2CC_INTERRUPT_TIMEOUT_A          (UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTA_SET)

/*!
 * @brief Timeout B Interrupt
 */
#define DL_I2CC_INTERRUPT_TIMEOUT_B          (UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTB_SET)


/** @}*/

/** @addtogroup DL_I2CC_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief Controller Transmit FIFO Trigger interrupt for DMA trigger
 */
#define DL_I2CC_DMA_INTERRUPT_TXFIFO_TRIGGER                            \
                                          (UNICOMMI2CC_DMA_TRIG0_IMASK_TXTRG_SET)

/*!
 * @brief Controller Receive FIFO Trigger interrupt for DMA trigger
 */
#define DL_I2CC_DMA_INTERRUPT_RXFIFO_TRIGGER                        \
                                          (UNICOMMI2CC_DMA_TRIG1_IMASK_RXTRG_SET)

/** @}*/

/* clang-format on */

/** @enum DL_I2CC_EVENT_ROUTE */
typedef enum {
    /*! I2CC event route 1 */
    DL_I2CC_EVENT_ROUTE_1 = 0,
    /*! I2CC event route 2 */
    DL_I2CC_EVENT_ROUTE_2 = 12
} DL_I2CC_EVENT_ROUTE;

/** @enum DL_I2CC_CLOCK */
typedef enum {
    /*!  BUSCLK enabled as I2CC clock source */
    DL_I2CC_CLOCK_BUSCLK = UNICOMMI2CC_CLKSEL_BUSCLK_SEL_ENABLE,
    /*!  MFCLK enabled as I2CC clock source */
    DL_I2CC_CLOCK_MFCLK = UNICOMMI2CC_CLKSEL_MFCLK_SEL_ENABLE,
    /*!  Asynchronous SYSCLK enabled as I2CC clock source */
    DL_I2CC_CLOCK_ASYNC_SYSCLK = UNICOMMI2CC_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE,
    /*!  Asynchronous HFCLK enabled as I2CC clock source */
    DL_I2CC_CLOCK_ASYNC_HFCLK = UNICOMMI2CC_CLKSEL_ASYNC_HFCLK_SEL_ENABLE,
    /*!  Asynchronous PLL enabled as I2CC clock source */
    DL_I2CC_CLOCK_ASYNC_PLL = UNICOMMI2CC_CLKSEL_ASYNC_PLL_SEL_ENABLE,
} DL_I2CC_CLOCK;

/** @enum DL_I2CC_CLOCK_DIVIDE */
typedef enum {
    /*!  I2CC Clock Divided by 1 */
    DL_I2CC_CLOCK_DIVIDE_1 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_1,
    /*!  I2CC Clock Divided by 2 */
    DL_I2CC_CLOCK_DIVIDE_2 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_2,
    /*!  I2CC Clock Divided by 3 */
    DL_I2CC_CLOCK_DIVIDE_3 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_3,
    /*!  I2CC Clock Divided by 4 */
    DL_I2CC_CLOCK_DIVIDE_4 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_4,
    /*!  I2CC Clock Divided by 5 */
    DL_I2CC_CLOCK_DIVIDE_5 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_5,
    /*!  I2CC Clock Divided by 6 */
    DL_I2CC_CLOCK_DIVIDE_6 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_6,
    /*!  I2CC Clock Divided by 7 */
    DL_I2CC_CLOCK_DIVIDE_7 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_7,
    /*!  I2CC Clock Divided by 8 */
    DL_I2CC_CLOCK_DIVIDE_8 = UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_8,
} DL_I2CC_CLOCK_DIVIDE;

/** @enum DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH */
typedef enum {
    /*!  Pulses filtering disabled.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_DISABLED =
        UNICOMMI2CC_GFCTL_DGFSEL_DISABLED,
    /*!  Pulses shorter than 1 functional clock tick in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_1 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_1,
    /*!  Pulses shorter than 2 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_2 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_2,
    /*!  Pulses shorter than 3 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_3 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_3,
    /*!  Pulses shorter than 4 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_4 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_4,
    /*!  Pulses shorter than 8 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_8 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_8,
    /*!  Pulses shorter than 16 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_16 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_16,
    /*!  Pulses shorter than 31 functional clock ticks in length are filtered.  */
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_31 =
        UNICOMMI2CC_GFCTL_DGFSEL_CLK_31,
} DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH;

/** @enum DL_I2CC_DIRECTION */
typedef enum {
    /*! Set direction to transmitting to target */
    DL_I2CC_DIRECTION_TX = UNICOMMI2CC_TA_DIR_TRANSMIT,
    /*! Set direction to receiving from target */
    DL_I2CC_DIRECTION_RX = UNICOMMI2CC_TA_DIR_RECEIVE,
} DL_I2CC_DIRECTION;

